

		while (!f.eof()){
			
			f >> mas[n]; // зчитуємо масив даних

			

						 // перевірка чи отримано значення
			if (!f) {  //  не отримано


				cout << "Error (syntax is incorrect)" << endl << endl; //вивід повідомлення про помилку
				f.close(); // закриття файлу
				goto q; // повернення на початок
				
			}
			else{ // якщо отримано
				sum = sum + mas[n]; // рахуємо суму

				n++; // рахуємо кількість елементів
			}
			
		 } 

		ser = sum / n; // рахуємо середнє арифметичне

		system("cls"); // очищаємо вікно консолі
		



		cout << "Arithmetic mean: " << ser << endl << endl; // виводимо середнє арифметичне значення на екран

		r << ser; //записуємо середнє арифметичне значення у файл

	}
	f.close();
	r.close(); // закриваємо файли

	system("pause");
    return 0;
}

